###################################################################

# Created by write_sdc on Tue Feb 15 20:58:09 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {PC[63]}]
set_load -pin_load 3.40189 [get_ports {PC[62]}]
set_load -pin_load 3.40189 [get_ports {PC[61]}]
set_load -pin_load 3.40189 [get_ports {PC[60]}]
set_load -pin_load 3.40189 [get_ports {PC[59]}]
set_load -pin_load 3.40189 [get_ports {PC[58]}]
set_load -pin_load 3.40189 [get_ports {PC[57]}]
set_load -pin_load 3.40189 [get_ports {PC[56]}]
set_load -pin_load 3.40189 [get_ports {PC[55]}]
set_load -pin_load 3.40189 [get_ports {PC[54]}]
set_load -pin_load 3.40189 [get_ports {PC[53]}]
set_load -pin_load 3.40189 [get_ports {PC[52]}]
set_load -pin_load 3.40189 [get_ports {PC[51]}]
set_load -pin_load 3.40189 [get_ports {PC[50]}]
set_load -pin_load 3.40189 [get_ports {PC[49]}]
set_load -pin_load 3.40189 [get_ports {PC[48]}]
set_load -pin_load 3.40189 [get_ports {PC[47]}]
set_load -pin_load 3.40189 [get_ports {PC[46]}]
set_load -pin_load 3.40189 [get_ports {PC[45]}]
set_load -pin_load 3.40189 [get_ports {PC[44]}]
set_load -pin_load 3.40189 [get_ports {PC[43]}]
set_load -pin_load 3.40189 [get_ports {PC[42]}]
set_load -pin_load 3.40189 [get_ports {PC[41]}]
set_load -pin_load 3.40189 [get_ports {PC[40]}]
set_load -pin_load 3.40189 [get_ports {PC[39]}]
set_load -pin_load 3.40189 [get_ports {PC[38]}]
set_load -pin_load 3.40189 [get_ports {PC[37]}]
set_load -pin_load 3.40189 [get_ports {PC[36]}]
set_load -pin_load 3.40189 [get_ports {PC[35]}]
set_load -pin_load 3.40189 [get_ports {PC[34]}]
set_load -pin_load 3.40189 [get_ports {PC[33]}]
set_load -pin_load 3.40189 [get_ports {PC[32]}]
set_load -pin_load 3.40189 [get_ports {PC[31]}]
set_load -pin_load 3.40189 [get_ports {PC[30]}]
set_load -pin_load 3.40189 [get_ports {PC[29]}]
set_load -pin_load 3.40189 [get_ports {PC[28]}]
set_load -pin_load 3.40189 [get_ports {PC[27]}]
set_load -pin_load 3.40189 [get_ports {PC[26]}]
set_load -pin_load 3.40189 [get_ports {PC[25]}]
set_load -pin_load 3.40189 [get_ports {PC[24]}]
set_load -pin_load 3.40189 [get_ports {PC[23]}]
set_load -pin_load 3.40189 [get_ports {PC[22]}]
set_load -pin_load 3.40189 [get_ports {PC[21]}]
set_load -pin_load 3.40189 [get_ports {PC[20]}]
set_load -pin_load 3.40189 [get_ports {PC[19]}]
set_load -pin_load 3.40189 [get_ports {PC[18]}]
set_load -pin_load 3.40189 [get_ports {PC[17]}]
set_load -pin_load 3.40189 [get_ports {PC[16]}]
set_load -pin_load 3.40189 [get_ports {PC[15]}]
set_load -pin_load 3.40189 [get_ports {PC[14]}]
set_load -pin_load 3.40189 [get_ports {PC[13]}]
set_load -pin_load 3.40189 [get_ports {PC[12]}]
set_load -pin_load 3.40189 [get_ports {PC[11]}]
set_load -pin_load 3.40189 [get_ports {PC[10]}]
set_load -pin_load 3.40189 [get_ports {PC[9]}]
set_load -pin_load 3.40189 [get_ports {PC[8]}]
set_load -pin_load 3.40189 [get_ports {PC[7]}]
set_load -pin_load 3.40189 [get_ports {PC[6]}]
set_load -pin_load 3.40189 [get_ports {PC[5]}]
set_load -pin_load 3.40189 [get_ports {PC[4]}]
set_load -pin_load 3.40189 [get_ports {PC[3]}]
set_load -pin_load 3.40189 [get_ports {PC[2]}]
set_load -pin_load 3.40189 [get_ports {PC[1]}]
set_load -pin_load 3.40189 [get_ports {PC[0]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[63]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[62]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[61]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[60]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[59]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[58]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[57]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[56]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[55]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[54]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[53]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[52]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[51]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[50]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[49]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[48]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[47]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[46]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[45]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[44]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[43]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[42]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[41]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[40]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[39]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[38]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[37]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[36]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[35]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[34]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[33]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[32]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[31]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[30]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[29]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[28]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[27]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[26]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[25]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[24]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[23]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[22]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[21]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[20]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[19]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[18]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[17]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[16]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[15]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[14]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[13]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[12]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[11]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[10]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[9]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[8]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[7]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[6]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[5]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[4]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[3]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[2]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[1]}]
set_load -pin_load 3.40189 [get_ports {DMEM_OUT[0]}]
set_load -pin_load 3.40189 [get_ports {DMEM_ADDR[5]}]
set_load -pin_load 3.40189 [get_ports {DMEM_ADDR[4]}]
set_load -pin_load 3.40189 [get_ports {DMEM_ADDR[3]}]
set_load -pin_load 3.40189 [get_ports {DMEM_ADDR[2]}]
set_load -pin_load 3.40189 [get_ports {DMEM_ADDR[1]}]
set_load -pin_load 3.40189 [get_ports {DMEM_ADDR[0]}]
set_load -pin_load 3.40189 [get_ports wrt_mem]
set_load -pin_load 3.40189 [get_ports rd_mem]
create_clock [get_ports clk]  -name myclock  -period 10  -waveform {0 5}
set_clock_uncertainty 0.07  [get_clocks myclock]
set_input_delay -clock myclock  -max 0.5  [get_ports rst]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[31]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[30]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[29]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[28]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[27]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[26]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[25]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[24]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[23]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[22]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[21]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[20]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[19]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[18]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[17]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[16]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[15]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[14]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[13]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[12]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[11]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[10]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[9]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[8]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[7]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[6]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[5]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[4]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[3]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[2]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[1]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {IR[0]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[63]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[62]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[61]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[60]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[59]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[58]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[57]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[56]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[55]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[54]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[53]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[52]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[51]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[50]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[49]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[48]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[47]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[46]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[45]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[44]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[43]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[42]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[41]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[40]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[39]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[38]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[37]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[36]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[35]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[34]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[33]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[32]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[31]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[30]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[29]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[28]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[27]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[26]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[25]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[24]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[23]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[22]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[21]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[20]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[19]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[18]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[17]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[16]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[15]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[14]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[13]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[12]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[11]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[10]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[9]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[8]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[7]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[6]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[5]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[4]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[3]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[2]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[1]}]
set_input_delay -clock myclock  -max 0.5  [get_ports {DMEM_IN[0]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[63]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[62]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[61]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[60]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[59]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[58]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[57]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[56]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[55]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[54]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[53]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[52]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[51]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[50]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[49]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[48]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[47]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[46]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[45]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[44]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[43]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[42]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[41]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[40]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[39]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[38]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[37]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[36]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[35]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[34]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[33]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[32]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[31]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[30]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[29]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[28]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[27]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[26]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[25]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[24]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[23]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[22]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[21]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[20]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[19]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[18]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[17]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[16]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[15]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[14]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[13]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[12]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[11]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[10]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[9]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[8]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[7]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[6]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[5]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[4]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[3]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[2]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[1]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {PC[0]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[63]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[62]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[61]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[60]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[59]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[58]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[57]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[56]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[55]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[54]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[53]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[52]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[51]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[50]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[49]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[48]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[47]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[46]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[45]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[44]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[43]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[42]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[41]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[40]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[39]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[38]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[37]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[36]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[35]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[34]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[33]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[32]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[31]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[30]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[29]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[28]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[27]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[26]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[25]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[24]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[23]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[22]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[21]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[20]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[19]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[18]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[17]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[16]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[15]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[14]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[13]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[12]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[11]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[10]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[9]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[8]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[7]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[6]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[5]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[4]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[3]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[2]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[1]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_OUT[0]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_ADDR[5]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_ADDR[4]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_ADDR[3]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_ADDR[2]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_ADDR[1]}]
set_output_delay -clock myclock  -max 0.5  [get_ports {DMEM_ADDR[0]}]
set_output_delay -clock myclock  -max 0.5  [get_ports wrt_mem]
set_output_delay -clock myclock  -max 0.5  [get_ports rd_mem]
